// Title: Rare or First-Time File Written
// Description: Detects files created on endpoints for the first time (potential targeted execution)
// Data Source: DeviceFileEvents
// MITRE ATT&CK:
//   Tactic: TA0002 - Execution
//   Technique: T1204 - User Execution
// Severity: Medium

DeviceFileEvents
| summarize FileCount = count() by DeviceName, FileName
| where FileCount == 1
| project DeviceName, FileName
